; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v6 - type_1 ?v8 - type_2)
 	      (pred_3 ?v2 - object ?v8 - type_2)
	      (pred_2 ?v6 - type_1 ?v4 - type_3)
	      (pred_1 ?v6 - type_1 ?v2 - object ?v4 - type_3))

   (:action op_3
       :parameters  (?v6 - type_1 ?v7 ?v3 - type_2)
       :precondition (and  (pred_4 ?v6 ?v7))
       :effect (and  (pred_4 ?v6 ?v3)
		     (not (pred_4 ?v6 ?v7))))

   (:action op_2
       :parameters (?v6 - type_1 ?v1 - object ?v5 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v1 ?v5) (pred_4 ?v6 ?v5) (pred_2 ?v6 ?v4))
       :effect (and (pred_1 ?v6 ?v1 ?v4)
		    (not (pred_3 ?v1 ?v5)) 
		    (not (pred_2 ?v6 ?v4))))

   (:action op_1
       :parameters (?v6 - type_1 ?v1 - object ?v5 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v1 ?v4) (pred_4 ?v6 ?v5))
       :effect (and (pred_3 ?v1 ?v5)
		    (pred_2 ?v6 ?v4)
		    (not (pred_1 ?v6 ?v1 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_04 obj_07 - type_1
obj_08 obj_01 obj_02 obj_10 - type_3
obj_12 obj_11 obj_13 obj_03 - type_2
obj_06 obj_14 obj_05 obj_09 - object)
(:init
(pred_4 obj_04 obj_03)
(pred_2 obj_04 obj_08)
(pred_2 obj_04 obj_01)
(pred_4 obj_07 obj_11)
(pred_2 obj_07 obj_02)
(pred_2 obj_07 obj_10)
(pred_3 obj_06 obj_12)
(pred_3 obj_14 obj_11)
(pred_3 obj_05 obj_13)
(pred_3 obj_09 obj_12)
)
(:goal
(and
(pred_3 obj_06 obj_03)
(pred_3 obj_14 obj_12)
(pred_3 obj_05 obj_03)
(pred_3 obj_09 obj_11)
)
)

(:constraints
  (always (not (pred_4 obj_04 obj_13)))
)
)

; plan
1. (op_3 obj_04 obj_03 obj_12)
   deleted: (pred_4 obj_04 obj_03)
   added: (pred_4 obj_04 obj_12)
   goals met: 0 of 4
2. (op_2 obj_07 obj_14 obj_11 obj_10)
   deleted: (pred_3 obj_14 obj_11) (pred_2 obj_07 obj_10)
   added: (pred_1 obj_07 obj_14 obj_10)
   goals met: 0 of 4
3. (op_3 obj_07 obj_11 obj_12)
   deleted: (pred_4 obj_07 obj_11)
   added: (pred_4 obj_07 obj_12)
   goals met: 0 of 4
4. (op_2 obj_04 obj_09 obj_12 obj_01)
   deleted: (pred_3 obj_09 obj_12) (pred_2 obj_04 obj_01)
   added: (pred_1 obj_04 obj_09 obj_01)
   goals met: 0 of 4
5. (op_3 obj_04 obj_12 obj_11)
   deleted: (pred_4 obj_04 obj_12)
   added: (pred_4 obj_04 obj_11)
   goals met: 0 of 4
6. (op_1 obj_07 obj_14 obj_12 obj_10)
   deleted: (pred_1 obj_07 obj_14 obj_10)
   added: (pred_3 obj_14 obj_12) (pred_2 obj_07 obj_10)
   goals met: 1 of 4
7. (op_2 obj_07 obj_06 obj_12 obj_02)
   deleted: (pred_3 obj_06 obj_12) (pred_2 obj_07 obj_02)
   added: (pred_1 obj_07 obj_06 obj_02)
   goals met: 1 of 4
8. (op_3 obj_07 obj_12 obj_13)
   deleted: (pred_4 obj_07 obj_12)
   added: (pred_4 obj_07 obj_13)
   goals met: 1 of 4
9. (op_1 obj_04 obj_09 obj_11 obj_01)
   deleted: (pred_1 obj_04 obj_09 obj_01)
   added: (pred_3 obj_09 obj_11) (pred_2 obj_04 obj_01)
   goals met: 2 of 4
10. (op_2 obj_07 obj_05 obj_13 obj_10)
   deleted: (pred_3 obj_05 obj_13) (pred_2 obj_07 obj_10)
   added: (pred_1 obj_07 obj_05 obj_10)
   goals met: 2 of 4
11. (op_3 obj_07 obj_13 obj_03)
   deleted: (pred_4 obj_07 obj_13)
   added: (pred_4 obj_07 obj_03)
   goals met: 2 of 4
12. (op_1 obj_07 obj_05 obj_03 obj_10)
   deleted: (pred_1 obj_07 obj_05 obj_10)
   added: (pred_3 obj_05 obj_03) (pred_2 obj_07 obj_10)
   goals met: 3 of 4
13. (op_1 obj_07 obj_06 obj_03 obj_02)
   deleted: (pred_1 obj_07 obj_06 obj_02)
   added: (pred_3 obj_06 obj_03) (pred_2 obj_07 obj_02)
   goals met: 4 of 4
